In [7]:
import pandas as pd
q_df = pd.DataFrame([['male', 'teacher'], 
              ['male', 'engineer'],
              ['female', None],
              ['female', 'engineer']],columns=['Sex','Profession'])
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female       None
3  female   engineer

In [8]:
q_df=q_df.fillna('others')
q_df

      Sex Profession
0    male    teacher
1    male   engineer
2  female     others
3  female   engineer

In [9]:
addition=pd.get_dummies(q_df[['Profession']])
q_df=pd.concat([q_df,addition],axis=1)
q_df

      Sex Profession  ...  Profession_others  Profession_teacher
0    male    teacher  ...                  0                   1
1    male   engineer  ...                  0                   0
2  female     others  ...                  1                   0
3  female   engineer  ...                  0                   0

[4 rows x 5 columns]

In [10]:
#職業無順序性，故採用One-hot Encoding